///@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

///~~~~~~~~~	Проект:			Driver EC605
///~~~~~~~~~	Прибор:			EC605
///~~~~~~~~~	Модуль:			Абстрактный класс коммуникационного обмена с прибором
///~~~~~~~~~	Разработка:	Демешкевич С.А.
///~~~~~~~~~	Дата:				27.07.2018

///@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

#include "stdafx.h"

#include "Connect.h"


IConnect::IConnect (/*void* Owner, CMessages *Message*/) :
	bConnected (false)
	//,bConnected(false)
	//, Mess (Message)
	//,	Own (Owner)
{
}


IConnect::~IConnect ()
{}
